mafeiGitHub/stm32Mp3/src/main.cpp
// main.cpp
//{{{  includes
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <stdint.h>
#include <math.h>

#include "memory.h"
#include "cmsis_os.h"

#include "lwip/netif.h"
#include "lwip/tcpip.h"
#include "lwip/dhcp.h"
#include "ipv4/lwip/ip_addr.h"
#include "lwip/api.h"
#include "os/ethernetif.h"

#include "cHttp.h"
#include "../httpServer/httpServer.h"
#include "../httpServer/ftpServer.h"

#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_msc.h"

#ifdef STM32F746G_DISCO
  #include "stm32746g_discovery.h"
  #include "stm32746g_discovery_ts.h"
  #include "stm32746g_discovery_audio.h"
  #include "stm32746g_discovery_qspi.h"
#else
  #include "stm32f769i_discovery.h"
  #include "stm32f769i_discovery_ts.h"
  #include "stm32f769i_discovery_audio.h"
  #include "stm32F769i_discovery_qspi.h"
#endif

#include "cSd.h"
#include "../fatfs/fatFs.h"

#include "decoders/cMp3decoder.h"
#include "../aac/neaacdec.h"

#include "cLcd.h"
#include "widgets/cRootContainer.h"
#include "widgets/cListWidget.h"
#include "widgets/cTextBox.h"
#include "widgets/cValueBox.h"
#include "widgets/cSelectText.h"
#include "widgets/cBmpWidget.h"
#include "widgets/cWaveCentreWidget.h"
#include "widgets/cWaveLensWidget.h"

#include "icons/radioIcon.h"

#include "decoders/cHlsLoader.h"
#include "widgets/cHlsDotsBox.h"
#include "widgets/cHlsPowerWidget.h"
#include "widgets/cHlsInfoBox.h"
//}}}

const bool kStaticIp = false;
//{{{
static const uint8_t SD_InquiryData[] = {
  0x00, 0x80, 0x02, 0x02, (24 - 5), 0x00, 0x00, 0x00,
  'C', 'o', 'l', 'i', 'n', ' ', ' ', ' ',                                         // Manufacturer: 8 bytes
  'S', 'D', ' ', 'd', 'i', 's', 'k', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', // Product     : 16 Bytes
  '0', '.', '9','9',                                                              // Version     : 4 Bytes
  };
//}}}
//{{{
static const USBD_StorageTypeDef USBD_DISK_fops = {
  SD_IsReady,
  SD_GetCapacity,
  SD_ReadCached,
  SD_WriteCached,
  (int8_t*)SD_InquiryData,
  };
//}}}

//{{{  static vars
static USBD_HandleTypeDef USBD_Device;

static osSemaphoreId mAudSem;
static bool mAudHalf = false;

static float mVolume = 0.7f;
static int mIntVolume = 0;
static bool mVolumeChanged = false;

// ui
static cLcd* mLcd = nullptr;
static cRootContainer* mRoot = nullptr;

// mp3
static int fileIndex = 0;
static bool fileIndexChanged = false;
static std::vector<std::string> mMp3Files;

static int mMp3PlayFrame = 0;
static bool mWaveLoad = false;
static bool mWaveChanged = false;
static int mWaveLoadFrame = 0;
static uint8_t* mWave = nullptr;
static int* mFrameOffsets = nullptr;

// hls
static cHlsLoader* mHlsLoader;
static osSemaphoreId mHlsLoaderSem;
static int mHlsChan = 3;
static int mHlsBitrate = 128000;
static bool mHlsChanged = false;
//}}}

//{{{  audio callbacks
//{{{
void BSP_AUDIO_OUT_HalfTransfer_CallBack() {
  mAudHalf = true;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//{{{
void BSP_AUDIO_OUT_TransferComplete_CallBack() {
  mAudHalf = false;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//}}}

//{{{
static void initHlsMenu() {

  mRoot->addBottomLeft (new cPowerWidget (mHlsLoader, mRoot->getWidth(), mRoot->getHeight()));

  mRoot->addTopLeft (new cBmpWidget (r1x80, 1, mHlsChan, mHlsChanged, 3, 3));
  mRoot->add (new cBmpWidget (r2x80, 2, mHlsChan, mHlsChanged, 3, 3));
  mRoot->add (new cBmpWidget (r3x80, 3, mHlsChan, mHlsChanged, 3, 3));
  mRoot->add (new cBmpWidget (r4x80, 4, mHlsChan, mHlsChanged, 3, 3));
  mRoot->add (new cBmpWidget (r5x80, 5, mHlsChan, mHlsChanged, 3, 3));
  mRoot->add (new cBmpWidget (r6x80, 6, mHlsChan, mHlsChanged, 3, 3));

  mRoot->addAt (new cInfoTextBox (mHlsLoader, mRoot->getWidth(), 1.2), -2 + mRoot->getWidth()/2.0f, -3 + mRoot->getHeight());

  mRoot->addBottomRight (new cDotsBox (mHlsLoader));
  mRoot->addLeft (new cSelectText("48", 48000, mHlsBitrate, mHlsChanged, 2));
  mRoot->addLeft (new cSelectText ("128", 128000, mHlsBitrate, mHlsChanged, 2));
  mRoot->addLeft (new cSelectText ("320", 320000, mHlsBitrate, mHlsChanged, 2));

  mRoot->addTopRight (new cValueBox (mVolume, mVolumeChanged, COL_YELLOW, 2.0f, mRoot->getHeight()));
  }
//}}}
//{{{
static void aacLoadThread (void const* argument) {

  cLcd::debug ("aacLoadThread");
  mHlsLoader->changeChan (mHlsChan, mHlsBitrate); //- mHlsLoader->getFramesFromSec (20);

  while (true) {
    if (mHlsChanged) {
      mHlsLoader->changeChan (mHlsChan, mHlsBitrate);
      mHlsChanged = false;
      }

    if (!mHlsLoader->load())
      osDelay (500);

    osSemaphoreWait (mHlsLoaderSem, osWaitForever);
    }
  }
//}}}
//{{{
static void aacPlayThread (void const* argument) {

  cLcd::debug ("aacPlayThread");

  #ifdef STM32F746G_DISCO
    BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_HEADPHONE, int(mVolume * 100), 48000);
    BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_02);
  #else
    BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_SPEAKER, int(mVolume * 100), 48000);
    BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_13);
  #endif

  memset ((void*)AUDIO_BUFFER, 0, 8192);
  BSP_AUDIO_OUT_Play ((uint16_t*)AUDIO_BUFFER, 8192);

  int lastSeqNum = 0;
  while (true) {
    if (osSemaphoreWait (mAudSem, 50) == osOK) {
      int seqNum;
      int16_t* audioSamples = mHlsLoader->getSamples (seqNum);
      if (audioSamples) {
        memcpy ((int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER + 4096), audioSamples, 4096);
        mHlsLoader->mPlayFrame++;
        }
      else
        memset ((int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER + 4096), 0, 4096);

      if (mHlsChanged || !seqNum || (seqNum != lastSeqNum)) {
        lastSeqNum = seqNum;
        osSemaphoreRelease (mHlsLoaderSem);
        }
      }
    }
  }
//}}}

//{{{
static void initMp3Menu() {

  mRoot->add (new cListWidget (mMp3Files, fileIndex, fileIndexChanged,
                               mRoot->getWidth(), 0.6f * mRoot->getHeight()));

  mRoot->add (new cWaveCentreWidget (mWave, mMp3PlayFrame, mWaveLoadFrame, mWaveLoadFrame, mWaveChanged,
                                     mRoot->getWidth(), 0.2f * mRoot->getHeight()));
  mRoot->add (new cWaveLensWidget (mWave, mMp3PlayFrame, mWaveLoadFrame, mWaveLoadFrame, mWaveChanged,
                                   mRoot->getWidth(), 0.2f * mRoot->getHeight()));

  mRoot->addTopRight (new cValueBox (mVolume, mVolumeChanged, COL_YELLOW, 2.0f, mRoot->getHeight()));
  }
//}}}
//{{{
static void listDirectory (std::string directoryName, std::string indent) {

  cLcd::debug ("dir " + directoryName);

  cDirectory directory (directoryName);
  if (directory.getError()) {
    //{{{  open error
    cLcd::debug (COL_RED, "directory open error:"  + cLcd::dec (directory.getError()));
    return;
    }
    //}}}

  cFileInfo fileInfo;
  while ((directory.find (fileInfo) == FR_OK) && !fileInfo.getEmpty()) {
    if (fileInfo.getBack()) {
      //cLcd::debug (fileInfo.getName());
      }

    else if (fileInfo.isDirectory())
      listDirectory (directoryName + "/" + fileInfo.getName(), indent + "-");

